Replaced ASCII graph with Mermaid
